VPro/src/Catalogs/BusinessActivities/BusinessActivities.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BusinessActivities</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Other</name>
      <description>Khác</description>
    </items>
    <items>
      <name>MainActivity</name>
      <description>Lĩnh vực hoạt động chính</description>
    </items>
  </predefined>
  <attributes>
    <name>GLAccountRevenueFromSales</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountCostOfSales</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>ProfitGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
</mdclass:Catalog>

VPro/src/Enums/GLAccountsTypes/GLAccountsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>GLAccountsTypes</name>
  <enumValues>
    <name>DepreciationFixedAssets</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>AccountsGroup</name>
    <comment>Service</comment>
  </enumValues>
  <enumValues>
    <name>Debitors</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>CashAssets</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>LongtermObligations</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Incomings</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Capital</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>IndirectExpenses</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>ShorttermInvestments</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Creditors</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>Loans</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>ProfitTax</name>
  </enumValues>
  <enumValues>
    <name>UnfinishedProduction</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>UndistributedProfit</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ProfitLosses</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>LoanInterest</name>
  </enumValues>
  <enumValues>
    <name>OtherFixedAssets</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>OtherShorttermObligations</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>ReserveAndAdditionalCapital</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>TradeMarkup</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/CounterpartyContracts/CounterpartyContracts.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CounterpartyContracts</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Counterparties</owners>
  <attributes>
    <name>ContractForm</name>
    <type>
      <types>CatalogRef.ContractForms</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BusinessActivity</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>CashFlowItem</name>
    <type>
      <types>CatalogRef.CashFlowItems</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractKind</name>
    <type>
      <types>EnumRef.ContractKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountMarkupKind</name>
    <type>
      <types>CatalogRef.MarkupAndDiscountKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>PriceKind</name>
    <type>
      <types>CatalogRef.PriceKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyPriceKind</name>
    <type>
      <types>CatalogRef.CounterpartyPriceKind</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractDaysBeforeInvoicing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractMonthsBeforeInvoicing</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractBusinessActivity</name>
    <type>
      <types>CatalogRef.BusinessActivities</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractPeriodicity</name>
    <type>
      <types>EnumRef.BillingServiceContractPeriodicity</types>
    </type>
  </attributes>
  <attributes>
    <name>ServiceContractTariffPlan</name>
    <type>
      <types>CatalogRef.ServiceContractsTariffPlans</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ContactPerson</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.CounterpartyContractTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyBankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.CounterpartyContractStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidityStartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ValidityEndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SettlementsInStandardUnits</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerPaymentDueDate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VendorPaymentDueDate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IsServiceContract</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>EditableParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>InfobaseParameters</name>
    <attributes>
      <name>FormRefs</name>
      <type>
        <types>CatalogRef.ContractForms</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Parameter</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
        <types>EnumRef.ContractsWithCounterpartiesTemplatesParameters</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ServiceContractMailingRecipients</name>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Contact</name>
      <type>
        <types>CatalogRef.ContactPersons</types>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Catalogs/BusinessActivities/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Event handler procedure ChoiceDataGetProcessor.
//
Procedure ChoiceDataGetProcessing(ChoiceData, Parameters, StandardProcessing)
	
	If Parameters.Property("ProductsAndServices") Then
		
		If Not Parameters.ProductsAndServices.ExpensesGLAccount.TypeOfAccount = Enums.GLAccountsTypes.Expenses Then
			
			MessageText = NStr("en='Business area cannot be selected for this expense.';ru='Для этого расхода нельзя выбрать направление деятельности!';vi='Đối với chi phí này không thể chọn lĩnh vực hoạt động kinh doanh!'");
			SmallBusinessServer.ShowMessageAboutError(, MessageText);
			
			StandardProcessing = False;
			
		EndIf;	
		
	EndIf;	
		
	If Parameters.Property("GLExpenseAccount") Then
		
		If ValueIsFilled(Parameters.GLExpenseAccount) Then
			
			If Parameters.GLExpenseAccount.TypeOfAccount = Enums.GLAccountsTypes.OtherExpenses Then
				
				MessageText = NStr("en='Business area is not specified for the ""Other expenses"" account type.';ru='Для счета типа ""Прочие расходы"" направление деятельности не указывается!';vi='Đối với tài khoản kiểu ""Chi phí khác"" chưa chỉ ra lĩnh vực hoạt động kinh doanh!'");
				SmallBusinessServer.ShowMessageAboutError(, MessageText);
				
				StandardProcessing = False;
				
			ElsIf Parameters.GLExpenseAccount.TypeOfAccount = Enums.GLAccountsTypes.UnfinishedProduction
				  OR Parameters.GLExpenseAccount.TypeOfAccount = Enums.GLAccountsTypes.IndirectExpenses Then
				  
				MessageText = NStr("en='Business area is not specified for the ""Unfinished production"" or ""Indirect expenses"" account types.';ru='Для счета типа ""Незавершенное производство"" или ""Косвенные затраты"" направление деятельности не указывается!';vi='Đối với tài khoản kiểu ""Sản xuất dở dang"" hoặc ""Chi phí gián tiếp"" chưa chỉ ra lĩnh vực hoạt động kinh doanh!'");
				SmallBusinessServer.ShowMessageAboutError(, MessageText);
				
				StandardProcessing = False;
				
			EndIf;
			
		Else
			
			MessageText = NStr("en='Account is not selected.';ru='Не выбран счет!';vi='Chưa chọn tài khoản!'");
			SmallBusinessServer.ShowMessageAboutError(, MessageText);
			
			StandardProcessing = False;
			
		EndIf;
		
	EndIf;
	
EndProcedure // ChoiceDataGetProcessor()

#Region PrintInterface

// Fills in the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see the fields content in the PrintManagement.CreatePrintCommandsCollection function
//
Procedure AddPrintCommands(PrintCommands) Export
	
	
	
EndProcedure

// Перенесет все направления деятельности для договоров обслуживания в иерархию выбранного в настройках объекта.
//
Procedure GroupServiceContractsActivityDirections() Export
	
	Parent = Constants.BillingHeadBusinessActivity.Get();
	
	Query = New Query;
	Query.Text =
	"SELECT DISTINCT
	|	CounterpartyContracts.ServiceContractBusinessActivity AS BusinessActivity
	|FROM
	|	Catalog.CounterpartyContracts AS CounterpartyContracts
	|WHERE
	|	CounterpartyContracts.IsServiceContract
	|	AND CounterpartyContracts.ServiceContractBusinessActivity <> VALUE(Catalog.BusinessActivities.EmptyRef)";
	
	SELECTION = Query.Execute().Select();
	
	BeginTransaction();
	While SELECTION.Next() Do
		
		BusinessActivityObject = SELECTION.BusinessActivity.GetObject();
		BusinessActivityObject.Parent = Parent;
		BusinessActivityObject.Write();
		
	EndDo;
	CommitTransaction();
	
EndProcedure

#EndRegion

#EndIf
